[
  {
    "path": "posts/2021-06-17-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "A makeover of merchandise trade of Singapore with its trading partners for the year 2011-2020.",
    "author": [
      {
        "name": "Mayurapriyann Arulmozhi Baskaran",
        "url": "https://www.linkedin.com/in/mayurapriyann/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualization\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2.0 Alternative Design\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3.0 Proposed Visualization\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n\r\n\r\n.columns {display: flex;}\r\nh1 {color: MidnightBlue;}\r\nh2 {color: Navy;}\r\nh3 {color: DarkSlateBlue;}\r\nimg{\r\n    border: 2px LightGrey;\r\n    border-style: solid\r\n}\r\n\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n\r\nFigure 1: Given visualization\r\n1.1 Clarity\r\nThe title of the graph is not present. An enlightening data visualization will be incomplete without a well-worded title, as it is one of the main components that grabs the attention of the people. Effective titles can reduce the mental effort of the readers and at the same time convey the intended goal of the visualization.\r\nBoth the axis has values ranging from 0 to 80 rightly representing exports and imports respectively but if we look at the graph, few values labeled against each country exceed the value in the x-axis and y-axis scales. Though it may represent the summation of exports and imports, it lacks clarity from the readers’ point of view as it is hard to interpret the export/import values.\r\nKey performance measures of the two countries are discussed below the visualization chart but since there is no information on the year for which the data has been visualized, it is very hard to relate. In-addition the description present below the graph presents the findings from the year 2009 and 2006 but the actual year of the graph is not clearly stated.\r\nThough the x-axis and y-axis are labeled as exports and imports, the placement of the x-axis and y-axis labels are inappropriate which can possibly lead the reader to misinterpret easily.\r\nEuropean Union which is composed of 27 countries is present in the chart. But, those countries are also present individually in the chart leading to biased comparison.\r\nThe size of the bubble graph represents the total trade of each country, but the order of the rank is not very obvious. Also the value of exports and imports are also not present.\r\n1.2 Aesthetics\r\nThe circles used to represent individual countries overlap each other making it difficult to interpret the size of the circle. Also, the names corresponding to each circle don’t follow a uniform alignment.\r\nThe x-axis and y-axis are on a continuous scale but tick marks are not present.\r\nAbsence of gridlines makes it even harder to map the x-axis and y-axis values to the center of the circle.\r\nSimilar colors are used for representing few of the countries making it ambiguous to interpret. The labeled values present on Mainland China and Hong Kong extends a bit out of the axis scale.\r\nAnnotations and tooltips are not efficiently used to provide some additional information to the readers.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\nFigure 2: Proposed Visualization Sketch 1\r\n\r\nFigure 3: Proposed Visualization Sketch 2\r\n2.1 Clarity\r\nTitle plays one of the key roles in grabbing the attention of the readers hence an appropriate chart title is given to the chart. Since the proposed dashboard has two visualizations, the main title is accompanied by caption to set the context for understanding the visualizations.\r\nThe original chart is limited to only the top 10 trading partners by overall trade for the year 2020. But the proposed chart is highly customizable by users as the users will have the ability to choose the year, trade type, top n, and bottom n countries. Hence it gives the user a wide variety of options to explore and compare as per their wish.\r\nThe parameter change is dynamically aligned with the title and each entity has been labeled respectively. Additional information such as import/export/total trade was put under one roof inside the tooltip for easy comparison.\r\nExtended version of the slope chart is presented for the user to pick the countries of their wish and compare year-over-year growth of the trade. Trade growth increase/decrease corresponding to the previous year is represented by labels.\r\nIn the slope chart presented, the monthly trend of import/export fluctuations was also included in the tooltip. The monthly trend gives added advantage to zoom in closely to look into any particular month and check how imports and exports have been affected by any historically significant event.\r\nA simple bar chart is used to list the top/bottom N countries by trade type. The slope chart on the right gives a detailed summary of the trend over 10 years. Since the selection of years is customizable the user can compare and contrast even for two or more years.\r\n2.2 Aesthetics\r\nBright and vibrant colors are used to distinguish the top 10 countries by corresponding trade type.\r\nThe tool tops in both the visualizations are efficiently used to present import and export information for the corresponding parameter.\r\nImports and exports visualizations present in the tooltip of both the charts are presented with uniform colors to avoid confusion.\r\nThe headers present in both the visualizations get updated as the user changes the parameter.\r\nThe axis scale is hidden in both the visualizations as the labels present against each datapoint infers the same information as that of the axis scale. Since both the charts are customizable, removing the axis scale can give some space for the graph and minimize the overlapping issues to a certain extent.\r\nThe year-over-year percentage growth is represented by red and green color to show the increase/decrease in trend compared to the previous selected year.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n\r\nFigure 3: Final Dashboard\r\n4.0 Step-by-step Guide\r\nUnzip the downloaded file from the SingStat website. Upload the excel sheet(outputFile.xlsx) into Tableau Prep builder. The first five rows in the excel sheet contain non-tabular data which needs to be excluded.\r\n\r\nFigure 4: Raw Excel Sheet\r\nUpload the ‘outputFile.xlsx’ into the Tableau Prep software. Under the ‘Tables’ pane, there are two sheets ‘T1’ and ‘T2’ representing the imports and exports data respectively.\r\n\r\nFigure 5: Tableau Prep Sheets\r\nIn the ‘Tables’ pane, there is a check box to select the ‘Data Interpreter’. Click on the check box in order to remove the unwanted data present in a non-tabular format in the excel file .\r\n\r\nFigure 6: Data Interpreter\r\nFrom the ‘Tables’ pane, drag and drop the sheets ‘T1’ and ‘T2’ in the canvas space.\r\n\r\nFigure 7: Sheets In Canvas Space\r\nOnce the sheets ‘T1’ and ‘T2’ are in the canvas space, click on the small ‘+’ icon displayed right next to ‘T1’ and ‘T2’ and add ‘Clean Step’ to both sheets ‘T1’ and ‘T2’.\r\n\r\nFigure 8: Add Clean Step Node\r\nBoth the sheets ‘T1’ and ‘T2’ hold the data of imports and exports values respectively. Hence, rename the sheets ‘T1’ and ‘T2‘ as ‘Imports’ and ‘Exports’ respectively.\r\n\r\nFigure 9: Rename Sheets\r\nBy selecting the clean step node, exclude the first seven records under the ‘Variables’ column. Because the first record contains the total sum of the import/export values over all the years and the next five records have the import/export values of individual continents. And the last record which is ‘European Union’ comprises 27 countries. Since we already have the data of the individual countries present under the European Union, we exclude ‘European Union’.\r\n\r\nFigure 10: Exclude Records\r\nAs the analysis is restricted to years ranging from 2011 to 2020, all the years that are before and after the ten-year range are excluded.\r\n\r\nFigure 11: Exclude Columns\r\nThe given data is in wide format (i.e) all the dates are present as columns. So, after the ‘Clean Step’ node, click on the small ‘+’ icon and add the ‘Pivot’ node to it.\r\n\r\nFigure 12: Add Pivot Node\r\nNow, drag all the dates to the pivot panel where the records get pivoted from columns to rows. Basically, the wide-format data is converted to a long format. Then rename the ‘Variables’ column to ‘Country’ and ‘Pivot 1 Values’ to ‘Date’ respectively.\r\n\r\nFigure 13: Pivot Columns To Rows\r\nThe Tableau Prep automatically identifies and assigns the data type of each column present in the table. But at times it may be wrongly identified hence we have to perform a manual data type change. The recently pivoted column which contains all the dates is initially assigned with string datatype. Hence, the data type field is right-clicked and the data type is changed to date format.\r\n\r\nFigure 14: Data Type Conversion\r\nThe next step after pivoting is to add the output node and run the flow to generate the pre-processed excel sheet. Add the ‘Output’ node to both the imports and exports sheet. Run the flow to generate ‘Imports.xlsx’ and ‘Exports.xlsx’ at the desired directory.\r\n\r\nFigure 15: Output Flow\r\nLaunch the Tableau application. Just drag and drop both the excel files ‘Imports.xlsx’ and ‘Exports.xlsx’ into Tableau.\r\n\r\nFigure 16: Upload Excel To Tableau\r\nThe imports and exports table are present in a different sheet. So, we have to combine the data from both sheets into a single table for our analysis. Hence, drag the ‘Exports.xlsx’ sheet onto the workspace and double click on it. Now, just drag the ‘Imports.xlsx’ next to the exports table and drop it. By default, an inner join relationship represented by two intersecting circles is established between the column having the country names.\r\n\r\nFigure 17: Establishing Inner Join Relationship\r\nIn addition to the join condition with the ‘Country’ column in both the tables, another join condition with the ‘Date’ column is established.\r\n\r\nFigure 18: Custom Split\r\nNow the joined table has two country columns and two date columns. Hide the country and date column corresponding to any one of the tables in order to avoid duplicate columns.\r\n\r\nFigure 19: Hide Duplicate Columns\r\nIn the ‘Country’ column all the country names are followed by ‘(Thousand Dollars)’ representing the scale. Custom split is used in order to split the country names by using ‘(‘ as the delimiter. Click on the arrow present in the ‘Country’ column and select ‘Custom Split’.\r\n\r\nFigure 20: Custom Split\r\nThe import and export values are given on thousand dollars scale. So, the import/export values are to be multiplied by 1000 to get the actual value of imports and exports. Hence, a new calculated field is created by clicking the arrow in the ‘Import (SGD)’ column and select ‘Create Calculated Field’.\r\n\r\nFigure 21: Create Calculated Field\r\nCreate a new calculated field by adding the import and export column in the formula box and multiply it with 1000 to get the actual value.\r\n\r\nFigure 22: Import Column Formula\r\nNow we have the actual value of imports and exports corresponding to each country month-wise. Create a new calculated field ‘Total Trade’ to sum up both the ‘Export’ and ‘Import’ columns.\r\n\r\nFigure 23: Total Trade Column Formula\r\nAnother calculated column, ‘Balance of Trade’ is created by finding the difference between exports and imports.\r\n\r\nFigure 24: Balance of Trade Column Formula\r\nThe table-level pre-processing is completed. Now open a new worksheet by clicking on the ‘New Worksheet’ icon present towards the bottom of the application.\r\n\r\nFigure 25: New Worksheet Icon\r\nCreate a new parameter by selecting ‘Create parameter’ from the drop-down present next to the ‘Search’ bar.\r\n\r\nFigure 26: Create Parameter\r\n‘Create parameter’ pop-up dialog box opens up. Create a new parameter ‘Trade Type’ with string datatype with a list consisting of Export, Import, Balance of Trade and Total Trade for the users to select trade type of his/her interest.\r\n\r\nFigure 27: Defining Parameter\r\nClick on the down arrow present to the right of the ‘Search’ bar and select ‘Create Calculated Field’ with column name as ‘Selected Trade Value’ and enter the formula as shown in the table. Drag the newly calculated field ‘Trade Type’ onto the Columns pane.\r\n\r\nFigure 28: Calculated Field Condition\r\n\r\nFigure 29: Columns Pane\r\nCreate another parameter named ‘Top or Bottom’ to give the users the flexibility to filter top N or bottom N countries as per the selected trade type.\r\n\r\nFigure 30: Defining Parameter\r\nCreate a new calculated field ‘Dynamic Rank’ for displaying the ranks of all the countries based on selected parameters.\r\n\r\nFigure 31: Calculated Field Condition\r\nDrop the newly calculated field ‘Dynamic Rank’ onto the Rows pane.\r\n\r\nFigure 32: Columns and Rows Pane\r\nDrag the ‘Country’ column to the color pane present under the Marks tool box in order to distinguish the countries based on the color. Select the arrow present to the right of the ‘Country’ column and sort it in descending order of the ‘Selected Trade Type’ column.\r\n\r\nFigure 33: Marks Tool Box\r\nClick on the arrow present towards the right of both the parameters ‘Top or Bottom’ and ‘Trade Type’, then select ‘Show Parameter’ to display the parameters onto the right of the worksheet.\r\n\r\nFigure 34: Display Parameter\r\nAgain, create a new parameter ‘Enter Value’ for the user to restrict the number of countries that have to be displayed.\r\n\r\nFigure 35: User Input Parameter\r\nDrag the ‘Date’ column to the Filter box and select the range of values as ‘Year’. A pop-up box gets displayed, select all the years. Once the filter is created, click on the down arrow present towards the right of it and select ‘Show Filter’ in order to filter by year.\r\n\r\nFigure 36: Add Date To Filter Pane\r\nClick on the small arrow in the year filter and select ‘Single Value (dropdown)’ to restrict the user to select only one year.\r\n\r\nFigure 37: Format Parameter\r\nRight-click on the ‘Country’ column and select ‘Create’ followed by ‘Set’ to create a new set. Create two-country sets for the top and bottom filter respectively. So once the user inputs the desired value into the parameter, the number of countries displayed in the chart gets restricted to the user input value.\r\n\r\nFigure 38: Create Sets\r\nCreate a calculated field to display the top and bottom countries as per the parameter change.\r\n\r\nFigure 39: Calculated Field\r\nA new worksheet is opened and a basic bar graph is created by adding the ‘Date’ and ‘Measure Names’ in the Columns pane. ‘Country’ and ‘Measure Values’ are dropped in the rows field. From the measure values, all the other column data except the exports and imports are removed since this will include only the exports and imports data in a bar chart format inside the tooltip of the previously created chart.\r\n\r\nFigure 40: Tooltip Graph Attributes\r\n\r\nFigure 41: Measure Names\r\nAdd ‘Country’ and ‘Selected Trade Type’ in the labels. And in the tooltip, add the columns exports, imports, and total trade value. The chart along with the label and tooltip is displayed as shown in the screenshot below.\r\n\r\nFigure 42: Tooltip Flyout\r\nThe completed visualization is shown in the screenshot below.\r\n\r\nFigure 43: Final Visualization 1\r\n\r\nFigure 44: Final Visualization 2\r\nOpen a new worksheet for the next visualization. The previous chart was to explore the trading partners with respect to the trade type to find the top/bottom N countries. The next chart is on a country-level visualization showing the year-over-year growth of the countries of the user’s choice. Firstly, Drag the column ‘Date’ to the columns pane.\r\n\r\nFigure 45: Add Date in Columns Pane\r\nAdd ‘Selected Trade Value’ to the Rows pane. The chart obtained is now a bar graph. Convert the bar graph into a line graph under the Marks tool box.\r\n\r\nFigure 46: Convert To Line Graph\r\nDrag and drop the ‘Country’ column onto the ‘Detail’ pane under the Marks tool box.\r\n\r\nFigure 47: Add Country To Detail\r\nClick on the arrow present towards the right of the ‘Selected Trade Value’ present in the Rows pane and uncheck ‘Show header’ from the dropdown list as the value of the measure would be labeled against each data point in the line graph.\r\n\r\nFigure 48: Remove Header\r\nThe Rows pane has the column ‘Selected Trade Value’ already in place. In addition, add the same column next to it.\r\n\r\nFigure 49: Add Same Field To Rows Pane\r\nSelect the pane under the Marks tool box that corresponds to the newly added column and change the chart type from line to circle. In this way, only the dots remain in the graph.\r\n\r\nFigure 50: Create Circle Graph\r\nAdjust the size of the circle to make sure it is not too big or too small. So that once the dot gets overlapped with the line graph, it doesn’t look odd.\r\n\r\nFigure 51: Adjust The Size\r\nRight-click on the axis of the newly created chart with dots and click on dual-axis to merge both the charts. The two graphs which were present one over the other get clubbed together into a single graph sharing a common x-axis.\r\n\r\nFigure 52: Create Dual Axis\r\nThough both the y-axis has the same scale, there might be a slight difference between them which can make dots appear separately from the line. So, right-click on any one of the axes and click on synchronize axis.\r\n\r\nFigure 53: Synchronize Axis\r\nRight-click on the ‘Trade Type’ parameter which was created as a part of the first chart and click on the ‘Show Parameter’ from the dropdown to display the trade type parameter towards the right of the chart. Add ‘Date’ and ‘Country’ to the Filters pane.\r\n\r\nFigure 54: Add Filters\r\nRight-click on the ‘Date’ and ‘Country’ columns from the Filters pane and select ‘Show Filter’ from the dropdown list. Both the filters get displayed towards the right of the worksheet.\r\n\r\nFigure 55: Show Filters\r\n‘Country’ column is added to the color pane under the Marks tool box for both the line graph and circle graph so that both are in the same color. The main reason for adding colors is to differentiate each country when the number of countries chosen by the customer exceeds the threshold which may lead to text overlap.\r\n\r\nFigure 56: Color Pane\r\nNow add the ‘Country’ column to the Label pane corresponding to the line graph and the ‘Selected Trade Value’ column to the Label pane corresponding to the dot graph.\r\n\r\nFigure 57: Slope Graph\r\nThe trade value in the graph is displayed with too many digits which may lead to ambiguity among the readers, hence right-click on the ‘Selected Trade Value’ label under the Marks toolbox and select ‘Format’.\r\n\r\nFigure 58: Format Tooltip\r\nClicking on the ‘Format’ opens a new pane towards the left. Click on the ‘Numbers (Custom)’ and select display units as Billions (B) for easy readability.\r\n\r\nFigure 59: Change Display Units\r\n\r\nFigure 60: Data Point Label\r\nA new calculated field ‘Percent Of Total’ is created by dividing the sum of the ‘Selected Trade Type’ column by the total sum of ‘Selected Trade Type’.\r\n\r\nFigure 61: Calculated Field\r\nThe objective is to obtain the percentage difference between the current year to the previous year. Hence, another calculated field is created by using the newly created calculated column from the previous step.\r\n\r\nFigure 62: Get Percentage Difference\r\nCreate another two calculated fields to represent if the percentage difference is positive or negative.\r\n\r\nFigure 63: Calculated Field - Positive\r\n\r\nFigure 64: Calculated Field - Negative\r\nAdd the newly created columns ‘Positive’ and ‘Negative’ in the Label pane from the Marks tool box to display the percentage difference in red and green color to visually indicate the trade increase/decrease.\r\n\r\nFigure 65: Dynamic Coloration\r\nIn order to further look at the monthly import and export for a particular year and country, a basic line chart is created in a new worksheet with ‘Year’ and ‘Month’ in Rows pane and ‘Country’ and ‘Import’, ‘Export’ columns in the Columns pane.\r\n\r\nFigure 66: Tooltip Graph\r\nNow the tooltip pane is opened and the necessary modification is done to include all the required fields so that even if there are any textual overlaps, the users can hover over the data point to get the complete information for that corresponding year and country.\r\n\r\nFigure 67: Tooltip Content\r\nThe completed visualization is shown in the screenshot.\r\n\r\nFigure 68: Tooltip Flyout\r\n\r\nFigure 69: Growth Comparision between 2011 and 2020\r\n\r\nFigure 70: Year-Over-Year Comaparision\r\n5.0 Derived Insights\r\nOver the ten years time period from 2011 to 2020, Hong Kong remains as the top net exporter of Singapore. The net exports reached the peak of $60.76 Billions in the year 2018 followed by a decline of 8.21% in the 2019. But the net exports has increased in the year 2020 by 4.91% though the whole year was worst hit by COVID-19 pandemic. Followed by Hong Kong, Indonesia consistently held the second position when it comes to net exports from 2011-2019 but dropped to fourth position in the year 2020 alone.\r\n\r\nFigure 71: Year-Over-Year Comparision - Hong Kong\r\nUnlike the net exporter, the top net importer was not consistently held by a single country for all the ten years from 2011-2020. From 2012-2017, United States was the top net importer of Singapore but from 2018-2020 Taiwan became the top net importer of Singapore.\r\n\r\nFigure 72: Top Net Importers - 2020\r\nThe total trade is calculated by summing the exports and imports. By looking at the bar chart from the year 2011 to 2020 we can say that China, Malaysia, United States, Indonesia, Japan were the Singapore’s key trading partners. Malaysia held the top spot for total trade in the year 2011 and 2012 but in 2013 China dethroned Malaysia to become the top trading partner of Singapore. And from 2013 to 2020, China retained its top position reaching its peak in the year 2019 with the total trade value of $137.31 Billions.\r\n\r\nFigure 73: Top 10 Total Trade - 2019\r\nThe sum of total trades for the respective years are present in the bottom of the dashboard. The overall trade value for the year 2011 was 943.1 Billions (Exports: 488.7 Billions & Imports: 454.5 Billions) and for the year 2020 was 939.4 Billions (Exports: 498.7 Billions & Imports: 440.7 Billions). From these figures, it can be inferred that the overall trade value was reduced by 0.39% whereas the exports value increased by 2% and imports value dropped by 3.03%. The balance of trade has shown major rise of 69.29% in the year 2020 (57.9 Billions) with that of the year 2011 (34.2 Billions).\r\n\r\nFigure 74: Trade Values - 2020\r\nThe top trading partners China, Malaysia, Indonesia, United States, and Japan are compared by the total trade value for 2011 vs 2020. It can be observed that only Mainland China and United States showed a total trade growth of 33.86% and 35.01% respectively while a declining trend is noticed for all other trading partners.\r\n\r\nFigure 75: Total Trades - 2011 vs 2020\r\nThe tooltip flyout gives us the monthly imports and exports trend corresponding to the selected year. Since, circuit breaker was implemented in Singapore from April 7th most of the countries showed a declining trend around that time period.\r\n\r\nThis was written as part of requirements for the Visual Analytics course offered by MITB.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T17:38:50+08:00",
    "input_file": "dataviz-makeover-2.knit.md"
  },
  {
    "path": "posts/2021-05-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A makeover of merchandise trade of Singapore with its top six trading partners for the year 2019-2020.",
    "author": [
      {
        "name": "Mayurapriyann Arulmozhi Baskaran",
        "url": "https://www.linkedin.com/in/mayurapriyann/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetics\r\n\r\n2.0 Alternative Design\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3.0 Proposed Visualisation\r\n4.0 Step-by-step Guide\r\n5.0 Derived Insights\r\n\r\n\r\n\r\n.columns {display: flex;}\r\nh1 {color: MidnightBlue;}\r\nh2 {color: Navy;}\r\nh3 {color: DarkSlateBlue;}\r\nimg{\r\n    border: 2px LightGrey;\r\n    border-style: solid\r\n}\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below.\r\n\r\nFigure 1: Given visualisation\r\n1.1 Clarity\r\nThe title of the chart says that the chart represents merchandise trade of the top six trading countries from 2019 to 2020. But most of the sub-charts have years ranging from 2019 to 2021. Moreover, the chart corresponding to Japan has only the year 2020 in its x-axis. In addition, the title just states the top six trading countries but whether those are the top six trading countries in the world or the top six trading countries with Singapore is not clear to the reader.\r\nThe y-axis scale for all 6 different countries is not consistent. The chart represents China and Japan to have similar export and import trends, in-fact Japan’s trade seems to be more than that of China but having a closer look at the y-axis reveals that China’s scale is from 0M-8M whereas Japan’s scale is only from 0M-2M. So all axis of the countries should be consistent with each other and also the dual-axis present in the y-axis should be synchronized as they represent exports and imports of the same country.\r\nThe x-axis is labeled as ‘Month of Period’ but the x-axis tick mark values correspond to year and not the month.\r\nUnit of measurement is nowhere mentioned in the graph. Since there are six different countries with different currencies, it is important to mention the unit of measurement.\r\nThe source of the chart is not present.\r\nArea chart is mostly preferred only to show how parts of a whole change over time. From our area chart, it is very hard to infer any insights. It is always recommended to avoid using a classic area chart as it is too confusing.\r\n1.2 Aesthetics\r\nThe use of colors to distinguish exports and imports is too pale. And since most of the sub-charts have overlapping of two colors, it is very hard to understand. Brighter and distinct coloration is always preferred.\r\nThe font size of the main title for the chart is smaller than the other secondary titles such as the country names in the chart.\r\nTick marks are not present in the y-axis. Tick marks are necessary on a continuous scale.\r\nThe secondary headers such as country names present in the chart are left-aligned. And since there are no gridlines, at times it gets confusing.\r\nAnnotations are not used to convey the key insights, leaving the reader to infer the purpose of the chart.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\nFigure 2: Proposed Sketch\r\n2.1 Clarity\r\nThe x-axis of all the countries has the same year range as mentioned in the main title of the chart.\r\nThe area chart is replaced by a stacked bar chart which gives the overall picture of the total trade as well as the exports and imports value in the corresponding year.\r\nLine chart is used on top of the stacked bar chart to show the rate of increase/decrease in trade value from that of the previous year. The percentage increase/decrease is also displayed in the chart to quantify the rate of change.\r\nAll six countries share the same y-axis so that it will be easy to compare and draw insights.\r\nLink to the source and raw data are provided at the bottom of the chart.\r\nUnit of measurement is clearly mentioned in the y-axis as there are different countries using different currencies.\r\nThe raw data excel file has a scale of thousand dollars so all the values are multiplied by 1000 to get the actual value of exports and imports.\r\n2.2 Aesthetics\r\nIn the y-axis, tick marks are added since the values are on a continuous scale. In addition, the tick marks were also changed to black color to make them visible to the naked eye.\r\nSoft and natural colors are used to distinguish export and import.\r\nGrid lines are used to separate six different countries.\r\nAnnotations are used to emphasize key observations.\r\nNumbers with too many digits are always difficult to interpret for the readers, hence all the values are converted to billions for easy reference.\r\n3.0 Proposed Visualisation\r\nPlease view the interactive visualisation on Tableau Public here.\r\n4.0 Step-by-step Guide\r\nImport the excel sheet(outputFile.xlsx) into Tableau Prep builder. The first five rows in the excel sheet contains non tabular data which needs to be excluded.\r\n\r\nFigure 3: Raw Excel Sheet\r\nCheck the ‘Data Interpreter’ check box to handle this issue. It is designed to help identify the structure of the data in excel file and turn it into a proper format.\r\n\r\nFigure 4: Data Interpreter\r\nRename the first sheet T1 as ‘Imports’ and add the ‘Clean step’ to the flow.\r\n\r\nFigure 5: Clean Step\r\nThe data table which was cleaned by data interpreter is displayed as shown below.\r\n\r\nFigure 6: Table After Cleaning\r\nIf you can notice, the first five rows are removed and the correct table header is assigned automatically.\r\nThe country names are listed under column ‘Variables’. But since we are interested in only the 6 countries given in the visualisation, use the filter function next to the ‘Variables’ column to filter out the 6 countries.\r\n\r\nFigure 7: Filter Values Dialog Box\r\nSince we are interested only in the year 2019-2020, drop all the other data range by selecting the desired date range and clicking on ‘Remove Field’.\r\n\r\nFigure 8: Selecting Multiple Columns\r\nRepeat the steps 1-4 for the second sheet T2 and rename the sheet to ‘Exports’.\r\nThe output table obtained is in wide format. Each month corresponding to the year is listed as separate measure as shown below. Wide format is not suitable for analysis, hence wide format has to be transformed to long format.\r\n\r\nFigure 9: Measure Values\r\n\r\nFigure 10: Wide Format Columns\r\nHence, after clean step add pivot step to convert wide format to long format and rename the columns as shown below.\r\n\r\nFigure 11: Pivot Columns to Rows\r\n\r\nFigure 12: Long Format Columns\r\nAfter pivoting and renaming the columns, both the sheets are saved into separate excel sheets namely ‘Imports.xlsx’ and ‘Exports.xlsx’.\r\n\r\nFigure 13: Final Flow Diagram\r\nNow import both the sheets into Tableau. Drag any one of the tables to the canvas and double click on the table to open the join canvas (physical layer).\r\n\r\nFigure 14: Imports Table In Tableau\r\nDrag another table to the join canvas.\r\n\r\nFigure 15: Inner Join Imports And Exports\r\nAs ‘Country’ and ‘Date’ columns are common to both the tables, we can use an inner join to join both the tables as shown in the screenshot. The final table after joining both the tables is shown below.\r\n\r\nFigure 16: Table After Inner Join\r\nNow date column and country column of any one of the tables is retained as both will have the same value. Country column is split with ‘(‘ as delimiter to retain only the country names.\r\n\r\nFigure 17: Custom Split\r\nDate column has data type as string. It has to be changed to date data type. The final table looks like below.\r\n\r\nFigure 18: Columns After Custom Split And Data Type Change\r\nThe scale in the raw data file is in thousand dollars, so both the ‘Import Amount’ and ‘Export Amount’ are to be multiplied by 1000 to get the actual value of imports and exports.\r\n\r\nFigure 19: Derived Column Import (SGD)\r\nThe new calculated columns are named as ‘Import (SGD)’ and ‘Export (SGD)’.\r\nA calculated column ‘Total Trade (SGD)’ is obtained by summing both the ‘Import (SGD)’ and ‘Export (SGD)’.\r\n\r\nFigure 20: Derived Column Total Trade\r\nDrag ‘Country’ and ‘Date’ to columns pane.\r\n\r\nFigure 21: Columns Pane\r\nDrag ‘Measure Values’ to rows pane.\r\n\r\nFigure 22: Rows Pane\r\n‘Measure Values’ consists of 6 values as shown below.\r\n\r\nFigure 23: Measure Values Content\r\nRemove ‘CNT(Imports)’ , ‘SUM(Export Amount)’, ‘SUM(Import Amount)’ and ‘SUM(Total Trade (SGD))’ from the ‘Measure Values’ column. The chart looks like below.\r\n\r\nFigure 24: Bar Chart\r\nNow drag and drop ‘Measure Names’ on color icon under the ‘Marks’ box. Under color icon click on ‘Edit colors’ and select the desired colors.\r\n\r\nFigure 25: Marks Pane\r\nThe stacked bar chart is ready as shown below.\r\n\r\nFigure 26: Stacked Bar Chart\r\nNow the derived column, ‘Total Trade (SGD)’ is dragged to column pane.\r\n\r\nFigure 27: Rows And Columns Pane\r\nRight click on the ‘Total Trade’ chart’s y-axis and click on the ‘Dual Axis’.\r\n\r\nFigure 28: Dual Axis\r\nNow the ‘Total Trade’ bar chart overlaps the stacked bar chart as the dual axis are in the same scale. Since both the axis are same, hide the y-axis present towards the right as it might confuse the readers.\r\n\r\nFigure 29: Edit Axis\r\nClick on the dropdown symbol next to ‘SUM(Total Trade (SGD))’ and change the chart type from bar to line.\r\n\r\nFigure 30: Change Chart Type\r\nNow drag the ‘Total Trade (SGD)’ column onto ‘Label’ icon. Total sum of the trade corresponding to that year is displayed on all the bars.\r\n\r\nFigure 31: Add Labels\r\nClick the dropdown next to ‘SUM(Total Trade (SGD))’ label and select ‘Percent Difference’ from ‘Quick Table Calculation’.\r\n\r\nFigure 32: Calculate Percentage Difference\r\nClick on the ‘Add Table Calculation’ and select ‘Pane (Across)’ under compute method.\r\n\r\nFigure 33: Add Table Calculation\r\nMake the tick marks in the y-axis visible to naked eye since it is on a continuous scale.\r\nRight click on the white space in the chart and click on ‘Annotate’ to add annotations to highlight key insights.\r\n\r\nFigure 34: Add Annotations\r\nThe final chart is ready after adding title, axis labels and captions.\r\n\r\nFigure 35: Final Visualisation\r\n5.0 Derived Insights\r\nOut of the top six trading partners of Singapore, Mainland China has the highest merchandise trade value of S$137.31 billion and S$136.2 billion for the years 2019 and 2020 respectively.\r\nExcept for Taiwan and Hong Kong, the total trade value of the remaining four countries decreased in the year 2020 from that of the previous year.\r\nMalaysia had the steepest fall of 8.46% in total trade value in the year 2020 from that of the previous year whereas, on the other hand, Taiwan witnessed the highest increase of 13.04% in the total trade value from that of the previous year.\r\nThe value of import for Singapore’s trade with Hong Kong only contributes less than 8% in both the years 2019 and 2020 of the total trade.\r\n\r\nFigure 36: Final Visualisation With Highlights\r\n\r\nThis was written as part of requirements for the Visual Analytics course offered by MITB.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T13:40:46+08:00",
    "input_file": {}
  }
]
